In [2]:
import pandas as pd
import sqlalchemy as sql
import os

In [3]:
# os.mkdir("./00_database")

In [4]:
engine = sql.create_engine("sqlite:///00_database/corona_virus.sqlite")

In [5]:
# this creates the database
connection = engine.connect()

In [7]:
corona_death_df = pd.read_excel("./CovidDeaths 1.xlsx")
corona_vaccine_df = pd.read_excel("./CovidVaccinations.xlsx")

In [17]:
titanic_df = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")

In [18]:
titanic_df.to_sql("titanic", con = connection)

887

In [20]:
pd.read_sql(" SELECT * FROM titanic", con = connection)

,index,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...,...
882,882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500